10/data/attachments/af414f2827b13dcf.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Ryan_down_Friend_12930_1</nif:username>
            <nif:friendToBeRequested>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>